In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['ashish','sachin','kapil','deepak'],
    "marks":[98, 97, 95, 93],
    "city":['delhi', 'new delhi', 'kerela', 'noida']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0  ashish     98      delhi
1  sachin     97  new delhi
2   kapil     95     kerela
3  deepak     93      noida

In [5]:
df.to_csv('friends.csv')

In [6]:
df.head(2)

     name  marks       city
0  ashish     98      delhi
1  sachin     97  new delhi

In [7]:
df.tail(2)

     name  marks    city
2   kapil     95  kerela
3  deepak     93   noida

In [8]:
df.describe()

           marks
count   4.000000
mean   95.750000
std     2.217356
min    93.000000
25%    94.500000
50%    96.000000
75%    97.250000
max    98.000000